from django.db import models

# กำหนด Enum สำหรับประเภทลูกค้า
class CustomerType(models.TextChoices):
    เทศบาลเมือง = 'เทศบาลเมือง'
    เทศบาลตำบล = 'เทศบาลตำบล'
    องค์กรบริหารส่วนตำบล = 'องค์กรบริหารส่วนตำบล'
    องค์การบริหารส่วนจังหวัด = 'องค์การบริหารส่วนจังหวัด'

# กำหนด Enum สำหรับสถานะลูกค้า
class CustomerStatus(models.TextChoices):
    ACTIVE = 'Active', 'Active'
    NOT_ACTIVE = 'Not Active', 'Not Active'

# กำหนด Enum สำหรับตำบล
class Subdistrict(models.TextChoices):
    ไล่โว่ = 'ตำบลไล่โว่','ตำบลไล่โว่'
    หนองลู = 'ตำบลหนองลู','ตำบลหนองลู'
    วังกะ = 'ตำบลวังกะ','ตำบลวังกะ'
    ปลังเผล = 'ตำบลปลังเผล','ตำบลปลังเผล'
    ปิล๊อก = 'ตำบลปิล๊อก','ตำบลปิล๊อก'
    ห้วยเขย่ง = 'ตำบลห้วยเขย่ง','ตำบลห้วยเขย่ง'
    หินดาด = 'ตำบลหินดาด','ตำบลหินดาด'
    ลิ่นถิ่น = 'ตำบลลิ่นถิ่น','ตำบลลิ่นถิ่น'
    สหกรณ์นิคม = 'ตำบลสหกรณ์นิคม','ตำบลสหกรณ์นิคม'
    ท่าขนุน = 'ตำบลท่าขนุน','ตำบลท่าขนุน'
    ชะแล = 'ตำบลชะแล','ตำบลชะแล'
    ไทรโยค = 'ตำบลไทรโยค','ตำบลไทรโยค'
    วังกระแจะ = 'ตำบลวังกระแจะ','ตำบลวังกระแจะ'
    บ้องตี้ = 'ตำบลบ้องตี้','ตำบลบ้องตี้'
    ลุ่มสุ่ม = 'ตำบลลุ่มสุ่ม','ตำบลลุ่มสุ่ม'
    สิงห์ = 'ตำบลสิงห์','ตำบลสิงห์'
    ศรีมงคล = 'ตำบลศรีมงคล','ตำบลศรีมงคล'
    เขาโจด = 'ตำบลเขาโจด','ตำบลเขาโจด'
    นาสวน = 'ตำบลนาสวน','ตำบลนาสวน'
    ด่านแม่แฉลบ = 'ตำบลด่านแม่แฉลบ','ตำบลด่านแม่แฉลบ'
    แม่กระบุง = 'ตำบลแม่กระบุง','ตำบลแม่กระบุง'
    หนองเป็ด = 'ตำบลหนองเป็ด','ตำบลหนองเป็ด'
    ท่ากระดาน = 'ตำบลท่ากระดาน','ตำบลท่ากระดาน'
    สมเด็ดเจริญ = 'ตำบลสมเด็ดเจริญ','ตำบลสมเด็ดเจริญ'
    หนองปรือ = 'ตำบลหนองปรือ','ตำบลหนองปรือ'
    หนองปลาไหล = 'ตำบลหนองปลาไหล','ตำบลหนองปลาไหล'
    หนองรี = 'ตำบลหนองรี','ตำบลหนองรี'
    หนองกร่าง = 'ตำบลหนองกร่าง','ตำบลหนองกร่าง'
    หลุมรัง = 'ตำบลหลุมรัง','ตำบลหลุมรัง'
    ช่องด่าน = 'ตำบลช่องด่าน','ตำบลช่องด่าน'
    บ่อพลอย = 'ตำบลบ่อพลอย','ตำบลบ่อพลอย'
    หนองกุ่ม = 'ตำบลหนองกุ่ม','ตำบลหนองกุ่ม'
    หนองปลิง = 'ตำบลหนองปลิง','ตำบลหนองปลิง'
    หนองฝ้าย = 'ตำบลหนองฝ้าย','ตำบลหนองฝ้าย'
    หนองโสน = 'ตำบลหนองโสน','ตำบลหนองโสน'
    เลาขวัญ = 'ตำบลเลาขวัญ','ตำบลเลาขวัญ'
    ทุ่งกระบ่ำ = 'ตำบลทุ่งกระบ่ำ','ตำบลทุ่งกระบ่ำ'
    หนองนกแก้ว = 'ตำบลหนองนกแก้ว','ตำบลหนองนกแก้ว'
    หนองประดู่ = 'ตำบลหนองประดู่','ตำบลหนองประดู่'
    วังไผ่ = 'ตำบลวังไผ่','ตำบลวังไผ่'
    สระลงเรือ = 'ตำบลสระลงเรือ','ตำบลสระลงเรือ'
    ห้วยกระเจา = 'ตำบลห้วยกระเจา','ตำบลห้วยกระเจา'
    ดอนแสลบ = 'ตำบลดอนแสลบ','ตำบลดอนแสลบ'
    รางหวาย = 'ตำบลรางหวาย','ตำบลรางหวาย'
    ดอนตาเพชร = 'ตำบลดอนตาเพชร','ตำบลดอนตาเพชร'
    หนองโรง = 'ตำบลหนองโรง','ตำบลหนองโรง'
    พังตรุ = 'ตำบลพังตรุ','ตำบลพังตรุ'
    พนมทวน = 'ตำบลพนมทวน','ตำบลพนมทวน'
    ทุ่งสมอ = 'ตำบลทุ่งสมอ','ตำบลทุ่งสมอ'
    หนองสาหร่าย = 'ตำบลหนองสาหร่าย','ตำบลหนองสาหร่าย'
    พงตึก = 'ตำบลพงตึก','ตำบลพงตึก'
    ยางม่วง = 'ตำบลยางม่วง','ตำบลยางม่วง'
    ดอนชะเอม = 'ตำบลดอนชะเอม','ตำบลดอนชะเอม'
    ท่าไม้ = 'ตำบลท่าไม้','ตำบลท่าไม้'
    ตระคร้ำเอน = 'ตำบลตระคร้ำเอน','ตำบลตระคร้ำเอน'
    ท่ามะกา = 'ตำบลท่ามะกา','ตำบลท่ามะกา'
    ท่าเรือ = 'ตำบลท่าเรือ','ตำบลท่าเรือ'
    โคกตะบอง = 'ตำบลโคกตะบอง','ตำบลโคกตะบอง'
    ดอนขมิ้น = 'ตำบลดอนขมิ้น','ตำบลดอนขมิ้น'
    อุโลกสี่หมื่น = 'ตำบลอุโลกสี่หมื่น','ตำบลอุโลกสี่หมื่น'
    เขาสามสิบหาบ = 'ตำบลเขาสามสิบหาบ','ตำบลเขาสามสิบหาบ'
    พระแท่น = 'ตำบลพระแท่น','ตำบลพระแท่น'
    หวายเหนียว = 'ตำบลหวายเหนียว','ตำบลหวายเหนียว'
    แสนตอ = 'ตำบลแสนตอ','ตำบลแสนตอ'
    สนามแย้ = 'ตำบลสนามแย้','ตำบลสนามแย้'
    ท่าเสา = 'ตำบลท่าเสา','ตำบลท่าเสา'
    หนองลาน = 'ตำบลหนองลาน','ตำบลหนองลาน'
    ท่าม่วง = 'ตำบลท่าม่วง','ตำบลท่าม่วง'
    วังขนาย = 'ตำบลวังขนาย','ตำบลวังขนาย'
    วังศาลา = 'ตำบลวังศาลา','ตำบลวังศาลา'
    ท่าล้อ = 'ตำบลท่าล้อ','ตำบลท่าล้อ'
    หนองขาว = 'ตำบลหนองขาว','ตำบลหนองขาว'
    ทุ่งทอง = 'ตำบลทุ่งทอง','ตำบลทุ่งทอง'
    เขาน้อย = 'ตำบลเขาน้อย','ตำบลเขาน้อย'
    ม่วงชุม = 'ตำบลม่วงชุม','ตำบลม่วงชุม'
    บ้านใหม่ = 'ตำบลบ้านใหม่','ตำบลบ้านใหม่'
    ตระคร้อ = 'ตำบลตระคร้อ','ตำบลตระคร้อ'
    รางสาลี่ = 'ตำบลรางสาลี่','ตำบลรางสาลี่'
    หนองตากยา = 'ตำบลหนองตากยา','ตำบลหนองตากยา'
    ช่องสะเดา = 'ตำบลช่องสะเดา','ตำบลช่องสะเดา'
    วังด้ง = 'ตำบลวังด้ง','ตำบลวังด้ง'
    ลาดหญ้า = 'ตำบลลาดหญ้า','ตำบลลาดหญ้า'
    หนองบัว = 'ตำบลหนองบัว','ตำบลหนองบัว'
    ปากแพรก = 'ตำบลปากแพรก','ตำบลปากแพรก'
    แก่งเสี้ยน = 'ตำบลแก่งเสี้ยน','ตำบลแก่งเสี้ยน'
    หนองหญ้า = 'ตำบลหนองหญ้า','ตำบลหนองหญ้า'
    วังเย็น = 'ตำบลวังเย็น','ตำบลวังเย็น'
    บ้านใต้ = 'ตำบลบ้านใต้','ตำบลบ้านใต้'
    บ้านเหนือ = 'ตำบลบ้านเหนือ','ตำบลบ้านเหนือ'
    ท่ามะขาม = 'ตำบลท่ามะขาม','ตำบลท่ามะขาม'
    เกาะสำโรง = 'ตำบลเกาะสำโรง','ตำบลเกาะสำโรง'
    กลอนโด = 'ตำบลกลอนโด','ตำบลกลอนโด'
    ด่านมะขามเตี้ย = 'ตำบลด่านมะขามเตี้ย','ตำบลด่านมะขามเตี้ย'
    หนองไผ่ = 'ตำบลหนองไผ่','ตำบลหนองไผ่'
    จรเข้เผือก = 'ตำบลจรเข้เผือก','ตำบลจรเข้เผือก'
    ท่าพุ = 'ตำบลท่าพุ','ตำบลท่าพุ'

# กำหนด Enum สำหรับอำเภอ
class District(models.TextChoices):
    เมืองกาญจนบุรี = 'อำเภอเมืองกาญจนบุรี', 'อำเภอเมืองกาญจนบุรี'
    ท่ามะกา = 'อำเภอท่ามะกา', 'อำเภอท่ามะกา'
    ท่าม่วง = 'อำเภอท่าม่วง', 'อำเภอท่าม่วง'
    พนมทวน = 'อำเภอพนมทวน', 'อำเภอพนมทวน'
    เลาขวัญ = 'อำเภอเลาขวัญ', 'อำเภอเลาขวัญ'
    ศรีสวัสดิ์ = 'อำเภอศรีสวัสดิ์', 'อำเภอศรีสวัสดิ์'
    ไทรโยค = 'อำเภอไทรโยค', 'อำเภอไทรโยค'
    ห้วยกระเจา = 'อำเภอห้วยกระเจา', 'อำเภอห้วยกระเจา'
    ทองผาภูมิ = 'อำเภอทองผาภูมิ', 'อำเภอทองผาภูมิ'
    สังขละบุรี = 'อำเภอสังขละบุรี', 'อำเภอสังขละบุรี'
    บ่อพลอย = 'อำเภอบ่อพลอย', 'อำเภอบ่อพลอย'
    หนองปรือ = 'อำเภอหนองปรือ', 'อำเภอหนองปรือ'
    ด่านมะขามเตี้ย = 'อำเภอด่านมะขามเตี้ย', 'อำเภอด่านมะขามเตี้ย'

# ที่อยู่ลูกค้า (แยกเป็น class)
class Address(models.Model):
    # ที่อยู่ (text)
    address = models.TextField()

    # ตำบล (choices)
    subdistrict = models.CharField(
        max_length=100,
        choices=Subdistrict.choices,
    )

    # อำเภอ (choices)
    district = models.CharField(
        max_length=100,
        choices=District.choices,
    )

    def __str__(self):
        return f"{self.address}, {self.subdistrict}, {self.district}"

# Customer model with address linked
class Customer(models.Model):
    # ชื่อลูกค้า
    name = models.CharField(max_length=200)
    
    # ประเภทลูกค้า
    customer_type = models.CharField(
        max_length=100,
        choices=CustomerType.choices,
    )
    
    # เชื่อมโยงที่อยู่ลูกค้า
    address = models.ForeignKey(Address, on_delete=models.CASCADE)

    # เบอร์โทรลูกค้า
    phone_number = models.CharField(max_length=15)
    
    # สถานะลูกค้า
    status = models.CharField(
        max_length=10,
        choices=CustomerStatus.choices,
        default=CustomerStatus.ACTIVE,
    )

# กำหนด Enum สำหรับประเภทบิล
class BillType(models.TextChoices):
    INVOICE = 'Invoice', 'Invoice'
    RECEIPT = 'Receipt', 'Receipt'
    CREDIT_NOTE = 'Credit Note', 'Credit Note'
    DEBIT_NOTE = 'Debit Note', 'Debit Note'

# กำหนด Bill model
class Bill(models.Model):
    # เลขบิล (char, ไม่ใช่ ID)
    bill_number = models.CharField(max_length=100, unique=True)

    # ประเภทบิล (ใช้ Enum)
    bill_type = models.CharField(
        max_length=50,
        choices=BillType.choices,
    )

    # วันที่ (Date)
    bill_date = models.DateField()

    #ราคาบิล (Float)
    bill_price = models.FloatField()

    #รายละเอียดบิล (Text)
    bill_info = models.TextField()

    # เชื่อมกับ Customer
    customer = models.ForeignKey(Customer, on_delete=models.CASCADE)


    def __str__(self):
        return f"{self.name} - {self.customer_type} ({self.status})"
